# SetTextureSize

## Description
Sets the texture size in real-world inches.

```pascal
PROCEDURE SetTextureSize(
				texture : HANDLE;
				newSize : REAL);
```

```python
def vs.SetTextureSize(texture, newSize):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|texture|HANDLE|   |
|newSize|REAL|   |

## Version
Availability: from VectorWorks10.1

## Category
* Textures